{"intents": [{"tag": "greeting", 
"patterns": ["Hi", "Hello", "Hey", "Good day", "How are you?","how was your day"],
 "responses": ["Hello!", "Good to see you!", "Hi there, how can I help?","Fine"], 
 "context_set": ""}, 
{"tag": "farewell", 
"patterns": ["Goodbye", "Bye", "See you later", "Talk to you later"],
 "responses": ["Sad to see you go :", "Goodbye!", "Come back soon!"], 
 "context_set": ""},
 {"tag": "creator",
  "patterns": ["Who created you?", "Who is your developer?", "Who made you?"],
   "responses": ["I was created by NEC Students."],
    "context_set": ""}, 
   {"tag": "identity",
    "patterns": ["What is your name?", "What should I call you?", "Who are you?"],
     "responses": ["You can call me Mind Reader. I'm a Chatbot."],
      "context_set": ""}, 
 {"tag": "hours",
  "patterns": ["What are the college timings?", "When is the college open?", "What are your hours of operation?"],
   "responses": ["The college is open from 8am to 5pm, Monday to Saturday."], 
   "context_set": ""}, 
 {"tag": "contact", 
 "patterns": ["How can I contact the college?", "What is the college telephone number?", "Can I get your contact number?"], 
 "responses": ["You can contact the college at 123456789."], 
 "context_set": ""}, 
 {"tag": "courses",
  "patterns": ["What courses are offered in the college?", "Can you tell me about the available courses?", "What are the branches in the college?"], 
  "responses": ["The college offers courses in Information Technology, Computer Engineering, Mechanical Engineering, Chemical Engineering, and Civil Engineering."], "context_set": ""}, 
 {"tag": "fees", 
 "patterns": ["How much is the college fee?", "Tell me about the fees", "What are the hostel fees?"], 
 "responses": ["For detailed fee information, please visit our college website."], 
 "context_set": ""}, 
 {"tag": "location",
  "patterns": ["Where is the college located?", "What is the college address?", "How can I reach the college?"], 
  "responses": ["The college is located at [insert address]. You can find the location on Google Maps."], 
  "context_set": ""}, 
 {"tag": "hostel", 
 "patterns": ["Does the college provide hostel facilities?", "Where is the hostel located?", "What are the hostel fees?"], 
 "responses": ["For detailed information about the hostel, please visit our college website."], 
 "context_set": ""}, 
 {"tag": "events", 
 "patterns": ["What events are organized in the college?", "Are there any upcoming events?", "Tell me about the college events."], 
 "responses": ["For information about the events, please visit our college website."], 
 "context_set": ""},
  {"tag": "admission", 
  "patterns": ["What is the admission process?", "How can I take admission in the college?", "Tell me about the admission criteria."],
   "responses": ["For detailed admission information, please visit our college website."],
    "context_set": ""},
   {"tag": "library", 
   "patterns": ["Does the college have a library?", "Where is the library located?", "What are the library timings?"],
    "responses": ["Yes, the college has a library. The library is located [insert location]. The timings are from 9am to 5pm, Monday to Friday."], "context_set": ""},
    {"tag": "facilities", 
    "patterns": ["What facilities are available in the college?", "Tell me about the college facilities.", "Do you have a sports complex?"], 
    "responses": ["The college provides various facilities including a sports complex, labs, cafeteria, and a library."], 
    "context_set": ""},
    {"tag": "placement", 
    "patterns": ["How are the placements in the college?", "Tell me about the college placements.", "What is the placement record?"],
     "responses": ["The college has a good placement record. Many reputed companies visit our campus for recruitment."], 
     "context_set": ""}, 
   {"tag": "school_choice", 
   "patterns": ["Why did you choose this school?", "What made you decide to attend this college?"], 
   "responses": ["I chose this school because of its strong academic reputation, excellent faculty, and a wide range of courses offered."], 
   "context_set": ""},
    {"tag": "happiness",
     "patterns": ["Are you happy here?", "Do you enjoy being at this college?"],
      "responses": ["As an AI, I don't have emotions, but I'm here to assist and provide information about the college."], 
      "context_set": ""}, 
    {"tag": "strengths",
     "patterns": ["What are your college strengths?", "What makes your college stand out?"],
      "responses": ["Our college excels in providing quality education, fostering a supportive learning environment, and offering a wide range of extracurricular activities."], "context_set": ""}, 
    {"tag": "complaints",
     "patterns": ["What's your #1 complaint about your school?", "What do you think needs improvement in your college?"],
      "responses": ["While my purpose is to provide information, some students may have different opinions. It's always good to provide feedback for continuous improvement."], "context_set": ""}, 
    {"tag": "improvements", 
    "patterns": ["What else could stand to be improved?", "In which areas do you think your college can improve?"], 
    "responses": ["Continuous improvement is essential for any institution. Areas that can be considered for improvement include infrastructure, facilities, and student support services."], "context_set": ""},
     {"tag": "accessibility", 
     "patterns": ["How accessible are administrators, registrars, financial aid officers, etc.?", "Can students easily reach out to college staff when needed?"], 
     "responses": ["The college administration strives to maintain accessibility for students. Office hours and contact information for various staff members are available for student assistance."], "context_set": ""},
     {"tag": "academics_majors", 
     "patterns": ["What majors are popular?", "Which fields of study have a high enrollment?", "What are the most sought-after majors in your college?"], 
     "responses": ["Popular majors in our college include Computer Science, Business Administration, Psychology, Engineering, and Biology."], "context_set": ""}, 
     {"tag": "academics_reputation",
      "patterns": ["What departments or programs have the best reputations?", "Which academic programs are well-regarded?", "Are there any standout departments in your college?"], 
      "responses": ["Our college has well-regarded departments in Computer Science, Engineering, and Business Administration. These programs have a strong reputation for academic excellence."], "context_set": ""}, 
     {"tag": "favorite_class", 
     "patterns": ["What's your favorite class?", "Which class do you enjoy the most?", "Do you have a favorite subject?"], 
     "responses": ["As an AI, I don't have personal preferences. However, students often enjoy classes that align with their interests and career goals."], "context_set": ""},
      {"tag": "professors_teachers", 
      "patterns": ["Are your professors good teachers?", "How is the quality of teaching at your college?", "Do you have experienced faculty?"], 
      "responses": ["Our college prides itself on having experienced and dedicated faculty members who are committed to providing quality education."], "context_set": ""}, 
     {"tag": "professors_office_hours",
      "patterns": ["Do your professors hold office hours, and will they meet with you outside of class?", "Are professors available for one-on-one meetings?", "Can students easily meet with professors?"], 
      "responses": ["Most professors at our college hold regular office hours and are available for one-on-one meetings to address student queries and provide additional guidance."], "context_set": ""},
      {"tag": "professors_vs_TAs", 
      "patterns": ["Are most of your classes taught by professors or teaching assistants?", "Who primarily teaches the classes?", "Do you have a lot of classes taught by TAs?"], 
      "responses": ["The majority of classes at our college are taught by professors. However, in some cases, teaching assistants may assist with course instruction or hold discussion sessions."], "context_set": ""},
      {"tag": "first_choice_classes",
       "patterns": ["Were you able to take most of your first-choice classes?", "Do students generally get their preferred classes?", "How likely are you to get into your desired classes?"], 
       "responses": ["While course availability can vary, our college aims to accommodate students' preferences as much as possible. Course registration is conducted on a first-come, first-served basis."], "context_set": ""}, 
      {"tag": "class_format",
       "patterns": ["Are your classes lecture-based or discussion-based?", "How are the classes structured?", "What's the typical format of a class?"], 
       "responses": ["The class format can vary depending on the subject and the instructor's teaching style. Some classes may be lecture-based, while others may involve more interactive discussions and group activities."], "context_set": ""},
       {"tag": "reading_writing",
        "patterns": ["How much reading and writing is required in your courses?", "Are there a lot of assignments involving reading and writing?", "Is there a heavy emphasis on written work?"], 
        "responses": ["The amount of reading and writing required in courses can vary. Generally, students can expect a balanced mix of reading assignments, written projects, and exams."], "context_set": ""},
        {"tag": "collaborative_work",
         "patterns": ["How often are collaborative work or group presentations required?", "Do you have a lot of group projects?", "Is there an emphasis on teamwork?"], 
         "responses": ["Collaborative work and group presentations are part of the learning experience at our college. Students often engage in group projects to enhance teamwork and develop important skills."], "context_set": ""},
        {"tag": "academic_advising", 
        "patterns": ["How satisfied are you with academic advising?", "Is the academic advising program helpful?", "Do advisors provide guidance for course selection?"],
         "responses":
          ["Academic advising plays a crucial role in guiding students' academic journeys. Our college has dedicated advisors who provide assistance with course selection, degree planning, and academic support."], "context_set": ""},
         {"tag": "tutoring_programs", 
         
         "patterns": ["Do students use any on-campus tutoring programs or writing centers?", "Are there resources available for academic support?", "How can I get tutoring assistance?"], 
         "responses": ["Our college provides on-campus tutoring programs and writing centers to support students in their academic endeavors. These resources can help students with subject-specific assistance and writing skills."], "context_set": ""},
         {"tag": "class_size", 
         "patterns": ["How big are your classes?", "Are the class sizes large or small?", "Do you have small class sizes?"],
          "responses": ["Class sizes can vary depending on the course and program. While some classes may have a larger enrollment, others, especially upper-level courses, tend to have smaller class sizes for more personalized attention."], "context_set": ""},
         {"tag": "independent_study", 
         "patterns": ["Does your major require an independent study or capstone project?", "Are there opportunities for independent research?", "Is there a culminating project for your major?"], 
         "responses": ["Many majors at our college offer opportunities for independent study or capstone projects. These experiences allow students to delve deeper into their fields of interest and apply their knowledge."], "context_set": ""}, 
         {"tag": "professor_research",
          "patterns": ["Are professors available for research with students?", "Can students engage in research projects with faculty?", "How can I get involved in research at your college?"], 
          "responses": ["Faculty members at our college actively engage in research, and students often have opportunities to collaborate on research projects. You can reach out to professors in your field of interest to inquire about research opportunities."], "context_set": ""}, 
         {"tag": "study_abroad",
          "patterns": ["Is it popular to study abroad?", "Are there study abroad programs available?", "Can students spend a semester abroad?"], 
          "responses": ["Studying abroad is a popular option for many students at our college. We offer various study abroad programs and opportunities to experience different cultures and gain international exposure."], "context_set": ""},
          {"tag": "first_year_experience", 
          "patterns": ["What's it like to be a first-year student here?", "Can you describe the first-year experience?", "What should I expect as a freshman?"], 
          "responses": ["As a first-year student, you can expect a supportive and welcoming environment. Orientation programs, peer mentoring, and academic support services are available to help you transition smoothly into college life."], "context_set": ""},
          {"tag": "typical_day",
           "patterns": ["What's a typical day like?", "Can you describe a day in the life of a student?", "What's the daily routine at your college?"], 
           "responses": ["A typical day as a student involves attending classes, engaging in study sessions, participating in extracurricular activities, and utilizing campus resources. Each student's daily routine may vary based on their schedule and interests."], "context_set": ""}, 
          {"tag": "study_time", 
          "patterns": ["How much time do students spend studying per week?", "Is there a lot of studying required?", "What's the average study time for students?"],
           "responses": ["The amount of time students spend studying can vary depending on their course load, study habits, and personal preferences. On average, students dedicate several hours per week to studying."], "context_set": ""},
           {"tag": "non_class_activities",
            "patterns": ["What do you do when you're not in class?", "How do students spend their free time?", "Are there activities to do outside of class?"],
             "responses": ["Outside of class, students engage in various activities such as participating in clubs and organizations, attending campus events, exploring the surrounding community, and spending time with friends."], "context_set": ""},
           {"tag": "weekend_activities", 
           "patterns": ["What do you do on the weekends?", "Are there weekend activities or events?", "How do students spend their weekends?"], 
           "responses": ["On weekends, students often take part in campus events, recreational activities, social gatherings, and may also use the time for relaxation and personal pursuits."], "context_set": ""}, 
          {"tag": "social_scene", 
          "patterns": ["What is the social scene like?", "How would you describe the social life on campus?", "Are there opportunities to meet new people?"],
           "responses": ["The social scene on campus is vibrant and diverse. There are plenty of opportunities to meet new people, join clubs and organizations, attend social events, and build lifelong friendships."], "context_set": ""}, 
          {"tag": "hometown_activities", 
          "patterns": ["What kinds of things are there to do in your school's hometown?", "Are there recreational activities in the local area?", "What are some popular attractions near the college?"], 
          "responses": ["Our school's hometown offers a range of recreational activities, cultural events, shopping centers, restaurants, and natural attractions. You can explore local parks, museums, theaters, and enjoy the local cuisine."], "context_set": ""}, 
          {"tag": "food", 
          "patterns": ["How's the food?", "What is the quality of the food on campus?", "Are there good dining options?"], 
          "responses": ["The college provides a variety of dining options on campus, including cafeterias, food courts, and specialty restaurants. The quality of food is generally satisfactory, with options to cater to different dietary preferences."], "context_set": ""}, 
          {"tag": "on_campus_housing",
           "patterns": ["Do most students live on-campus?", "Are there on-campus housing options?", "What percentage of students live in dorms?"],
            "responses": ["While the availability of on-campus housing may vary, many students choose to live in dorms or residence halls provided by the college. Off-campus housing options are also available for students."], "context_set": ""}, 
          {"tag": "dorm_quality", 
          "patterns": ["How are the dorms?", "Are the dormitories comfortable?", "What's the quality of on-campus housing?"], 
          "responses": ["The quality of dormitories varies based on the specific residence halls. Generally, the college strives to provide comfortable and convenient living spaces with amenities that cater to students' needs."], "context_set": ""},
           {"tag": "popular_clubs", 
           "patterns": ["Which clubs and student organizations are popular?", "Are there any standout clubs on campus?", "What are some of the most active student organizations?"], 
           "responses": ["Our college has a wide range of clubs and student organizations catering to diverse interests. Popular clubs include academic organizations, cultural clubs, sports teams, community service groups, and more."], "context_set": ""}, 
           {"tag": "fraternities_sororities",
            "patterns": ["Do lots of students belong to fraternities or sororities?", "Are there many Greek organizations on campus?", "What's the Greek life like at your college?"], 
            "responses": ["While the presence and prominence of fraternities and sororities can vary among colleges, our college does have a Greek life community. Participation in these organizations is a personal choice for interested students."], "context_set": ""},
             {"tag": "favorite_place_on_campus", "patterns": ["What's your favorite place on campus?", "Which location do you enjoy the most?", "Where do students like to hang out?"], "responses": ["As an AI, I don't have personal preferences. However, many students enjoy spending time in common areas, libraries, student centers, outdoor spaces, and campus cafeterias."], "context_set": ""},
            {"tag": "study_locations", 
            "patterns": ["Where do you like to study?", "What are some good study spots?", "Are there quiet places to study on campus?"], 
            "responses": ["There are several study spots on campus, including libraries, study lounges, coffee shops, and outdoor seating areas. It's important to find a location that suits your study preferences and helps you focus."], "context_set": ""}, 
            {"tag": "campus_facilities", 
            "patterns": ["What are the facilities like (science labs, libraries, theaters, gyms, etc.)?", "Are the campus facilities well-maintained?", "Does the college have modern facilities?"], 
            "responses": ["Our college prides itself on maintaining well-equipped facilities to support students' academic and extracurricular activities. This includes modern science labs, libraries with extensive resources, theaters, and well-equipped gyms."], "context_set": ""},
             {"tag": "computer_labs", "patterns": ["Are there enough computer labs?", "How accessible are the computer labs?", "Is there a shortage of computer lab facilities?"], "responses": ["Our college provides an ample number of computer labs across campus. These labs are accessible to students and equipped with the necessary technology and software needed for academic work."], "context_set": ""}, 
            {"tag": "campus_wifi", 
            "patterns": ["How is the WiFi on campus?", "Is the campus WiFi reliable?", "Are there any connectivity issues with the WiFi?"], 
            "responses": ["The campus WiFi network is designed to provide reliable internet connectivity to students, faculty, and staff. However, occasional connectivity issues may arise, which are usually promptly addressed by the IT department."], "context_set": ""}, 
            {"tag": "campus_navigation",
             "patterns": ["Is it easy to get around campus?", "Are the campus buildings easy to navigate?", "Is the campus layout student-friendly?"], 
             "responses": ["The campus is designed to be student-friendly, and campus buildings are typically well-marked and easy to navigate. Campus maps, signage, and digital resources are available to help students find their way around."], "context_set": ""}, 
          {"tag": "sports_popularity",
           "patterns": ["Are sports popular?", "Do many students participate in sports?", "What's the athletic culture like at your college?"], 
           "responses": ["Sports are popular at our college, and many students participate in various athletic activities. We have a range of sports teams, intramural sports, and fitness programs to cater to different interests and skill levels."], "context_set": ""}, 
          {"tag": "school_spirit", 
          "patterns": ["Is there a lot of school spirit?", "Do students show a strong sense of school pride?", "Are there spirited events or traditions?"], 
          "responses": ["Our college has a vibrant school spirit, and students often show a strong sense of pride in their institution. There are spirited events, traditions, and opportunities to engage with the college community and showcase school pride."], "context_set": ""}, 
          {"tag": "fellow_students", 
          "patterns": ["How would you describe your fellow students?", "What are the students like?", "Is there a sense of community among students?"], 
          "responses": ["The student body is diverse and inclusive, with individuals from various backgrounds, interests, and experiences. Students generally foster a sense of community and support each other's academic and personal growth."], "context_set": ""}, 
          {"tag": "friendly_students",
           "patterns": ["Are the students here friendly?", "Is it easy to make friends?", "Do students interact with each other?"], 
           "responses": ["Yes, the students here are generally friendly and welcoming. The college environment provides ample opportunities to meet new people, make friends, and form meaningful connections both inside and outside the classroom."], "context_set": ""},
          {"tag": "student_body_unique",
           "patterns": ["What makes the student body unique?", "Is there anything special about the student population?", "What sets the students apart at your college?"], 
           "responses": ["The student body at our college is unique in its diversity of backgrounds, perspectives, talents, and passions. This diversity fosters a rich learning environment and encourages students to embrace different cultures and viewpoints."], "context_set": ""}, {"tag": "campus_diversity", 
           "patterns": ["Is there diversity on campus?", "Are there students from different cultural backgrounds?", "Does the college promote diversity and inclusion?"], 
           "responses": ["Yes, our college values diversity and strives to create an inclusive campus community. Students from different cultural backgrounds, ethnicities, and countries contribute to the diverse fabric of our college community."], "context_set": ""},
           {"tag": "international_students",

            "patterns": ["Are there many students from other countries?", "Do you have a significant international student population?", "How diverse is the international representation at your college?"], 
            "responses": ["Our college welcomes students from around the world, and we have a diverse international student population. International students contribute to the cultural exchange and global perspectives within the college community."], "context_set": ""}, 
          {"tag": "interactions_among_students", 
          "patterns": ["Do students of different races and classes interact easily?", "Is there interaction and socialization among diverse groups?", "Do students embrace diversity and engage in cross-cultural interactions?"], 
          "responses": ["Students at our college have opportunities to interact and socialize with peers from different races, classes, and cultural backgrounds. The college promotes a welcoming and inclusive environment that encourages cross-cultural interactions and understanding."], "context_set": ""}, 
          {"tag": "student_cliques", 
          "patterns": ["Are students cliquish?", "Is there a presence of cliques on campus?", "Do students segregate into exclusive groups?"],
           "responses": ["While some social groups may naturally form based on shared interests and affiliations, our college encourages inclusivity and fosters an environment where students from different backgrounds can mingle and form connections beyond cliques."], "context_set": ""},
           {"tag": "internship_opportunities", 
           "patterns": ["Are internships available? How do you find them?", "What internship opportunities are there?", "How does the college support students in finding internships?"], 
           "responses": ["Internship opportunities are available for students, and the college often provides resources and support to help students find and secure internships. The college's career services office and faculty advisors can offer guidance in exploring and applying for internships."], "context_set": ""}, 
          {"tag": "career_services", 
          "patterns": ["Is Career Services helpful?", "What services does the career center provide?", "How effective is the college's career guidance?"], 
          "responses": ["Career Services at our college offers various resources and assistance to help students with career exploration, resume building, job search strategies, interview preparation, and more. Many students find the career guidance helpful in their professional development."], "context_set": ""}, 
          {"tag": "mentorship_program",
           "patterns": ["Do you have a mentor?", "Is there a mentorship program?", "How can students connect with mentors?"], 
           "responses": ["Our college may have a mentorship program or opportunities for students to connect with mentors. These programs facilitate valuable guidance and support from experienced individuals who can provide insights and advice on academic and career paths."], "context_set": ""}, 
          {"tag": "co-op_program", 
          "patterns": ["Does your school have a co-op program?", "Are there cooperative education opportunities?", "How does the college support students in co-op experiences?"], 
          "responses": ["Some colleges offer co-op programs where students can gain practical work experience related to their field of study while earning academic credit. If our college has a co-op program, students can explore such opportunities with the support of the college's career services or cooperative education office."], "context_set": ""},
           {"tag": "leadership_opportunities", 
           "patterns": ["What options exist for leadership skills on campus?", "Are there leadership programs or positions?", "How can students develop leadership skills?"], 
           "responses": ["Our college offers various opportunities for students to develop leadership skills. Students can join student government, clubs, or organizations that provide leadership positions, participate in leadership workshops or programs, and engage in community service to foster leadership qualities."], "context_set": ""}, 
           {"tag": "service_learning", 
           "patterns": ["What options exist for service learning in the community?", "Are there community service programs?", "How can students get involved in community service?"], 
           "responses": ["Our college often encourages service learning and community engagement. Students can get involved in community service programs, volunteer with local organizations, participate in service-learning courses, or join campus initiatives dedicated to making a positive impact in the community."], "context_set": ""},
           {"tag": "employer_recruitment", 
           "patterns": ["Do employers recruit students on campus?", "Are there career fairs or job fairs?", "How does the college connect students with potential employers?"], 
           "responses": ["Employer recruitment is a common practice at many colleges. Career fairs, job fairs, and networking events are organized to connect students with potential employers. The college's career services office often plays a role in facilitating these connections."], "context_set": ""},
           {"tag": "summer_jobs",
            "patterns": ["How easy is it to find summer jobs and other kinds of work through your school?", "Are there resources for finding summer employment?", "Does the college assist with summer job opportunities?"], 
            "responses": ["Our college may provide resources and support to help students find summer jobs and other types of employment. The career services office, online job boards, and networking events can be valuable in exploring and securing summer job opportunities."], "context_set": ""},
            {"tag": "notable_graduates", 
            "patterns": ["Who are some of the notable graduates from your college?", "Can you mention any famous alumni?", "Which successful individuals attended your college?"], 
            "responses": ["Our college has a distinguished list of notable graduates and successful alumni in various fields. Some may include renowned professionals, entrepreneurs, artists, scientists, and leaders who have made significant contributions to their respective fields."], "context_set": ""}, 
          {"tag": "alumni_association", 
          "patterns": ["How visible is your school's alumni association on campus?", "Does the college have an active alumni network?", "Are there opportunities to connect with alumni?"],
           "responses": ["Many colleges have active alumni associations that offer networking opportunities, mentorship programs, and career support for current students. The visibility and engagement of the alumni association can vary, but efforts are often made to connect students with alumni."], "context_set": ""}, 
          {"tag": "hands-on_experiences", 
          "patterns": ["What kinds of hands-on or practical experiences have you had in and outside of the classroom?", "Are there opportunities for practical learning?", "How does the college emphasize experiential learning?"],
           "responses": ["Colleges often provide opportunities for hands-on and practical experiences both inside and outside the classroom. These may include internships, research projects, fieldwork, service-learning, study abroad programs, and collaborative projects that enhance the learning process and offer real-world application of knowledge."], "context_set": ""},
           {"tag": "campus_diversity",
           "patterns": ["Tell me about the diversity on campus.", "How inclusive is the college?", "Are there initiatives for campus diversity?"],
           "responses": ["Our college values diversity and strives to create an inclusive community where students from various backgrounds feel welcome."],
           "context_set": ""},
          
          {"tag": "student_organizations",
           "patterns": ["What student organizations are there?", "Tell me about college traditions.", "Are there active clubs on campus?"],
           "responses": ["Our college offers a variety of student organizations and engaging traditions that contribute to a vibrant campus life."],
           "context_set": ""},
          
          {"tag": "social_life",
           "patterns": ["How is the social life on campus?", "Are there opportunities to meet new people?", "Tell me about the club scene."],
           "responses": ["The campus provides a lively social scene with numerous clubs and activities, offering plenty of opportunities to meet new people."],
           "context_set": ""},
          
          {"tag": "mental_health_services",
           "patterns": ["What mental health services are available?", "Tell me about counseling services.", "Are there stress management resources?"],
           "responses": ["Our college offers counseling services and resources to support mental health and well-being."],
           "context_set": ""},
          
          {"tag": "support_groups",
           "patterns": ["Are there support groups on campus?", "Tell me about mental health support.", "How can students access support groups?"],
           "responses": ["Support groups are available on campus, providing students with spaces to connect and share experiences."],
           "context_set": ""},
          
          {"tag": "healthcare_facilities",
           "patterns": ["What healthcare facilities are on campus?", "Tell me about emergency response procedures.", "Are there health services for students?"],
           "responses": ["Our campus is equipped with healthcare facilities, and we have well-defined emergency response procedures in place."],
           "context_set": ""},
          
          {"tag": "security_measures",
           "patterns": ["How safe is the campus?", "Tell me about security measures.", "Are there security personnel on campus?"],
           "responses": ["The safety of our students is a priority. We have security measures in place, including personnel, to ensure a secure campus environment."],
           "context_set": ""},
          
          {"tag": "sustainability_initiatives",
           "patterns": ["Tell me about green initiatives on campus.", "Are there recycling programs?", "How eco-friendly is the college?"],
           "responses": ["Our college is committed to sustainability, with various green initiatives and recycling programs in place."],
           "context_set": ""},
          
          {"tag": "eco_friendly_housing",
           "patterns": ["Are there eco-friendly housing options?", "Tell me about sustainable living.", "What housing choices promote environmental friendliness?"],
           "responses": ["We offer eco-friendly housing options that align with our commitment to sustainability."],
           "context_set": ""},
          
          {"tag": "location_transportation",
           "patterns": ["Where is the college located?", "Tell me about transportation options.", "Is the campus easily accessible?"],
           "responses": ["The college is located in [insert location], easily accessible by [mention transportation options]."],
           "context_set": ""},
          
          {"tag": "housing_dining",
           "patterns": ["What are the on-campus housing options?", "Tell me about dorms vs. apartments.", "What meal plans are available?"],
           "responses": ["We provide a range of on-campus housing options, including dormitories and apartments. Various meal plans are available to cater to students' dining preferences."],
           "context_set": ""},
          
          {"tag": "financial_aid",
           "patterns": ["What types of financial aid are available?", "Tell me about the financial aid application process.", "Do you have financial planning tips for students?"],
           "responses": ["Our college offers various types of financial aid. The application process and financial planning tips can be found on the college website."],
           "context_set": ""},
          
          {"tag": "admission_requirements",
           "patterns": ["What are the admission requirements?", "Tell me about GPA and test scores.", "What are the essay prompts for admission?"],
           "responses": ["Admission requirements include [mention requirements such as GPA, test scores, and essay prompts]. Detailed information is available on the college website."],
           "context_set": ""},
          
          {"tag": "career_services_internships",
           "patterns": ["How does the college support career services?", "Tell me about career fairs and internships.", "Are there resume workshops available?"],
           "responses": ["Our college provides comprehensive career services, including career fairs, internships, and resume workshops to assist students in their professional development."],
           "context_set": ""},
          
          {"tag": "arts_humanities",
           "patterns": ["Tell me about arts and humanities programs.", "Are there opportunities in music, theater, and writing?", "What languages are offered?"],
           "responses": ["Our college offers diverse programs in arts and humanities, including music, theater, dance, writing, and a variety of foreign languages."],
           "context_set": ""},
          
          {"tag": "science_technology",
           "patterns": ["Tell me about science and technology programs.", "Are there research labs?", "What fields are covered in engineering and computer science?"],
           "responses": ["Science and technology programs at our college include [mention programs and fields], and we have well-equipped research labs for hands-on learning."],
           "context_set": ""},
          
          {"tag": "business_social_sciences",
           "patterns": ["Tell me about business and social sciences programs.", "What fields are covered in economics and political science?", "Are there management and marketing courses?"],
           "responses": ["Our college offers a range of programs in business and social sciences, covering fields such as economics, political science, management, and marketing."],
           "context_set": ""},
          
          {"tag": "healthcare_pre_professional",
           "patterns": ["Tell me about healthcare and pre-professional programs.", "What medical and pre-law programs are available?", "Do you offer nursing or veterinary medicine?"],
           "responses": ["Our college provides excellent healthcare and pre-professional programs, including [mention specific programs such as nursing, medicine, law, dentistry, and veterinary medicine]."],
           "context_set": ""},
          
          {"tag": "athletics_sports",
           "patterns": ["Tell me about athletics and sports at the college.", "Are there varsity sports?", "What recreational activities are available?"],
           "responses": ["Our college has a vibrant athletics and sports community, including varsity sports and various recreational activities for students to enjoy."],
           "context_set": ""},
          
          {"tag": "virtual_tours_highlights",
           "patterns": ["Can I take a virtual tour of the campus?", "Tell me about campus highlights.", "Are there immersive experiences to explore the campus?"],
           "responses": ["Yes, we offer virtual tours and highlight experiences that provide an immersive way to explore the campus without physically visiting."],
           "context_set": ""},
          
          {"tag": "student_testimonials",
           "patterns": ["Can I read personal testimonials from students?", "Tell me about student stories.", "Where can I find authentic perspectives from current students?"],
           "responses": ["Explore personal testimonials and authentic student stories to gain real insights into the college experience."],
           "context_set": ""},
          
           {"tag": "q_and_a_forums",
           "patterns": ["How can I connect with college admissions officers?", "Tell me about Q&A forums and chats.", "Are there opportunities to chat with current students?"],
           "responses": ["Connect with college admissions officers and fellow students through Q&A forums and chats to get your questions answered."],
           "context_set": ""},
          
          {"tag": "real_time_data_statistics",
           "patterns": ["Where can I find real-time data and statistics about the college?", "Tell me about enrollment and graduation rates.", "What are the current financial aid percentages?"],
           "responses": ["Access up-to-date information on enrollment, graduation rates, and financial aid percentages to make informed decisions about the college."],
           "context_set": ""},
           {"tag": "academic_support_services",
 "patterns": ["Are there academic support services?", "How can I get help with my studies?", "Tell me about tutoring services."],
 "responses": ["Our college offers academic support services, including tutoring programs and study resources.", "You can access tutoring services and other academic support to enhance your studies."],
 "context_set": ""},

{"tag": "online_learning_resources",
 "patterns": ["What online resources are available for learning?", "Are there virtual learning materials?", "Tell me about online courses."],
 "responses": ["Explore a variety of online learning resources, including virtual courses and materials, to enhance your educational experience."],
 "context_set": ""},

{"tag": "extracurricular_activities",
 "patterns": ["What extracurricular activities are offered?", "Tell me about clubs and organizations.", "Are there opportunities for involvement outside of class?"],
 "responses": ["Our college provides a diverse range of extracurricular activities, from clubs to sports, allowing students to pursue various interests outside of academics."],
 "context_set": ""},

{"tag": "health_and_wellness",
 "patterns": ["Are there health and wellness programs?", "Tell me about campus health services.", "What resources promote student well-being?"],
 "responses": ["Explore health and wellness programs, including campus health services and resources aimed at supporting the well-being of our students."],
 "context_set": ""},

{"tag": "community_engagement",
 "patterns": ["Is community engagement encouraged?", "Tell me about community service opportunities.", "Are there programs to get involved in the local community?"],
 "responses": ["Our college encourages community engagement, offering various opportunities for students to participate in community service and make a positive impact."],
 "context_set": ""},

{"tag": "technology_resources",
 "patterns": ["What technology resources are available?", "Tell me about computer labs.", "Is the campus well-equipped with technology?"],
 "responses": ["Discover a range of technology resources, including computer labs and well-equipped facilities, to support your academic and technological needs."],
 "context_set": ""},

{"tag": "graduation_requirements",
 "patterns": ["What are the graduation requirements?", "Tell me about the criteria for graduation.", "Are there specific courses needed to graduate?"],
 "responses": ["Explore the graduation requirements, including criteria and necessary courses, to help you plan your academic journey towards graduation."],
 "context_set": ""},

{"tag": "financial_planning",
 "patterns": ["How can I plan my finances for college?", "Tell me about financial planning resources.", "Are there tips for managing college expenses?"],
 "responses": ["Access financial planning resources and tips to help you manage your finances effectively during your college journey."],
 "context_set": ""},

{"tag": "admissions_process",
 "patterns": ["What is the admissions process like?", "Tell me about the steps for admission.", "Are there specific requirements for admission?"],
 "responses": ["Learn about the admissions process, including steps and requirements, to guide you through the application and acceptance procedures."],
 "context_set": ""},

{"tag": "student_feedback",
 "patterns": ["Is there a system for student feedback?", "Tell me about providing feedback.", "Are there surveys for student opinions?"],
 "responses": ["Our college values student feedback, and there are mechanisms in place for providing your opinions and suggestions to improve the overall college experience."],
 "context_set": ""},
 {"tag": "academic_honor_code",
 "patterns": ["Is there an academic honor code?", "Tell me about academic integrity policies.", "What are the consequences for plagiarism?"],
 "responses": ["Our college upholds an academic honor code to ensure fairness, honesty, and integrity in academic pursuits.", "Familiarize yourself with the academic honor code, which outlines expectations and consequences related to academic integrity."],
 "context_set": ""},

{"tag": "study_abroad_opportunities",
 "patterns": ["Are there study abroad opportunities?", "Tell me about international exchange programs.", "Can students spend a semester in another country?"],
 "responses": ["Explore exciting study abroad opportunities that allow students to experience different cultures and broaden their academic horizons.", "Our college offers various study abroad programs, providing students with enriching international experiences."],
 "context_set": ""},

{"tag": "graduate_school_preparation",
 "patterns": ["How does the college prepare students for graduate school?", "Tell me about resources for postgraduate studies.", "Are there advisors for graduate school applications?"],
 "responses": ["Our college provides resources and guidance to help students prepare for graduate school, including advising on applications and necessary preparations.", "Explore the support and resources available for students planning to pursue postgraduate studies."],
 "context_set": ""},

{"tag": "undergraduate_research",
 "patterns": ["Is undergraduate research encouraged?", "Tell me about opportunities for research projects.", "Can students collaborate with professors on research?"],
 "responses": ["Undergraduate research is actively encouraged, and students often have opportunities to collaborate with professors on research projects that align with their academic interests.", "Engage in meaningful research experiences as an undergraduate, collaborating with faculty members on projects that contribute to your field of study."],
 "context_set": ""},

{"tag": "career_mentorship",
 "patterns": ["Is there a career mentorship program?", "Tell me about mentorship opportunities.", "How can students connect with mentors for career guidance?"],
 "responses": ["Explore career mentorship programs that connect students with experienced professionals, providing valuable guidance and insights into career paths.", "Connect with mentors who can offer guidance on career choices and help you navigate the professional landscape."],
 "context_set": ""},

{"tag": "entrepreneurship_programs",
 "patterns": ["Are there programs for aspiring entrepreneurs?", "Tell me about entrepreneurship courses.", "Can students receive support for startup ventures?"],
 "responses": ["Our college offers programs and courses designed for aspiring entrepreneurs, providing the knowledge and support needed to explore startup ventures.", "Explore entrepreneurship programs that equip students with the skills and resources to pursue innovative ventures."],
 "context_set": ""},

{"tag": "student_job_placement",
 "patterns": ["How successful is the college in job placement?", "Tell me about employment rates for graduates.", "Are there resources for finding post-graduation employment?"],
 "responses": ["Discover the success of our college in job placement, including employment rates for graduates and resources available to assist students in finding post-graduation opportunities.", "Explore the college's commitment to helping students secure meaningful employment through effective job placement resources."],
 "context_set": ""},

{"tag": "academic_calendar",
 "patterns": ["Where can I find the academic calendar?", "Tell me about important dates for the academic year.", "Are there specific dates for exams and breaks?"],
 "responses": ["Access the academic calendar to stay informed about important dates, including exam schedules, breaks, and other key events throughout the academic year.", "Stay updated on the academic calendar, which provides information on crucial dates, exam schedules, and holidays."],
 "context_set": ""},

{"tag": "peer_mentoring_program",
 "patterns": ["Is there a peer mentoring program?", "Tell me about opportunities for peer mentoring.", "How can students become peer mentors?"],
 "responses": ["Our college offers a peer mentoring program, providing opportunities for students to receive guidance and support from their peers.", "Engage in peer mentoring programs where students can support and mentor each other, fostering a sense of community and academic success."],
 "context_set": ""},

{"tag": "campus_sustainability_efforts",
 "patterns": ["Tell me about campus sustainability initiatives.", "Are there eco-friendly practices on campus?", "How is the college contributing to environmental conservation?"],
 "responses": ["Explore the college's commitment to sustainability through various initiatives and practices aimed at reducing environmental impact.", "Learn about campus sustainability efforts and how the college is actively contributing to environmental conservation."],
 "context_set": ""},

{"tag": "personal_development_resources",
 "patterns": ["Are there resources for personal development?", "Tell me about programs for personal growth.", "Can students access resources for building life skills?"],
 "responses": ["Our college provides resources and programs for personal development, allowing students to enhance their life skills and foster personal growth.", "Explore opportunities for personal development, including programs and resources that focus on building essential life skills."],
 "context_set": ""},

{"tag": "language_learning_opportunities",
 "patterns": ["Are there language learning opportunities?", "Tell me about language courses offered.", "Can students learn new languages during their studies?"],
 "responses": ["Discover language learning opportunities at our college, where students can explore a variety of language courses and enhance their linguistic skills.", "Explore language learning programs that allow students to acquire proficiency in different languages as part of their academic journey."],
 "context_set": ""},

{"tag": "graduate_success_stories",
 "patterns": ["Can I learn about success stories of graduates?", "Tell me about notable alumni achievements.", "Are there profiles of successful individuals who graduated from the college?"],
 "responses": ["Explore success stories of graduates who have achieved notable accomplishments in various fields, contributing to the college's legacy of excellence.", "Learn about the achievements of our notable alumni and their impact in diverse professional domains."],
 "context_set": ""},

{"tag": "pre_professional_advising",
 "patterns": ["Is there advising for pre-professional programs?", "Tell me about resources for pre-law students.", "Can students receive guidance for medical or law school preparation?"],
 "responses": ["Our college offers pre-professional advising to guide students pursuing paths such as law, medicine, and other professional fields.", "Explore resources and guidance available for pre-professional programs, including support for students preparing for law or medical school."],
 "context_set": ""},

{"tag": "work_study_opportunities",
 "patterns": ["Are work-study opportunities available?", "Tell me about the work-study program.", "Can students gain work experience while studying?"],
 "responses": ["Discover work-study opportunities that allow students to gain valuable work experience while pursuing their studies, contributing to both academic and professional growth.", "Explore the work-study program, where students can engage in meaningful employment experiences while balancing their academic commitments."],
 "context_set": ""},

{"tag": "counseling_services",
 "patterns": ["Are counseling services available on campus?", "Tell me about mental health support.", "Can students access counseling resources for personal well-being?"],
 "responses": ["Our college provides counseling services to support the mental health and well-being of students, offering resources for personal and emotional support.", "Access counseling services on campus to prioritize your mental health, with resources available to address personal well-being and emotional needs."],
 "context_set": ""},

{"tag": "parental_support_resources",
 "patterns": ["Is there support for parents of college students?", "Tell me about resources for parents.", "Are there programs to involve parents in the college experience?"],
 "responses": ["Explore support resources designed for parents of college students, providing information, guidance, and programs to actively involve parents in the college experience.", "Learn about programs and resources that support parents, fostering their involvement in their child's college journey."],
 "context_set": ""},

{"tag": "research_grant_opportunities",
 "patterns": ["Are there opportunities for research grants?", "Tell me about applying for research funding.", "Can students pursue funded research projects?"],
 "responses": ["Explore research grant opportunities that enable students to pursue funded research projects, contributing to their academic and professional development.", "Learn about the process of applying for research funding and discover opportunities to undertake meaningful research projects with financial support."],
 "context_set": ""},

{"tag": "alumni_network",
 "patterns": ["Tell me about the college's alumni network.", "Are there networking events for alumni?", "Can students connect with alumni for mentorship?"],
 "responses": ["Explore the vibrant alumni network of our college, providing opportunities for networking, mentorship, and collaboration with successful individuals in various fields.", "Connect with the extensive alumni network to engage in networking events, mentorship programs, and collaborative opportunities."],
 "context_set": ""},

{"tag": "dining_options",
 "patterns": ["What dining options are available on campus?", "Tell me about meal plans.", "Can students choose from different dining facilities?"],
 "responses": ["Discover a variety of dining options on campus, including meal plans and diverse facilities catering to different culinary preferences.", "Explore the dining options available, with meal plans and facilities that offer a range of choices to suit students' preferences."],
 "context_set": ""},

{"tag": "community_culture",
 "patterns": ["Tell me about the community culture.", "What values define the college community?", "How inclusive is the campus culture?"],
 "responses": ["Learn about the rich community culture that defines our college, emphasizing values such as diversity, inclusion, and collaboration.", "Explore the inclusive campus culture that fosters a sense of community, where diverse perspectives and backgrounds contribute to a vibrant learning environment."],
 "context_set": ""},

{"tag": "international_student_support",
 "patterns": ["Is there support for international students?", "Tell me about resources for international students.", "Can students find assistance with visa processes?"],
 "responses": ["Our college offers comprehensive support for international students, including resources for academic success, cultural integration, and assistance with visa processes.", "Explore resources tailored to the needs of international students, providing support for academic, cultural, and visa-related aspects of their college experience."],
 "context_set": ""},

{"tag": "fitness_and_recreation",
 "patterns": ["What fitness and recreation facilities are available?", "Tell me about campus sports and fitness programs.", "Can students participate in recreational activities?"],
 "responses": ["Discover fitness and recreation facilities on campus, including sports programs and recreational activities that contribute to the overall well-being of students.", "Engage in campus fitness and recreation programs, promoting a healthy and active lifestyle through various sports and recreational activities."],
 "context_set": ""},

{"tag": "community_outreach",
 "patterns": ["Tell me about community outreach programs.", "Are there initiatives to engage with the local community?", "How does the college contribute to community development?"],
 "responses": ["Explore community outreach programs that connect the college with the local community, fostering partnerships and initiatives for community development.", "Learn about the college's commitment to community outreach, with programs and initiatives that contribute to the betterment of the local community."],
 "context_set": ""},

{"tag": "student_diversity",
 "patterns": ["Tell me about the diversity of the student body.", "What initiatives promote diversity and inclusion?", "How diverse is the campus community?"],
 "responses": ["Learn about the vibrant student diversity that characterizes our campus, with initiatives promoting inclusivity and creating a welcoming environment for students from diverse backgrounds.", "Explore the rich tapestry of student diversity on campus, supported by initiatives that prioritize inclusivity and understanding among students."],
 "context_set": ""},

{"tag": "housing_options",
 "patterns": ["What housing options are available for students?", "Tell me about on-campus housing.", "Can students choose from different types of accommodation?"],
 "responses": ["Discover the housing options available, including on-campus housing with diverse accommodation types to meet the preferences and needs of students.", "Explore a range of housing options, with on-campus facilities offering different types of accommodation to suit the lifestyle choices of students."],
 "context_set": ""},

{"tag": "student_awards_and_recognition",
 "patterns": ["Tell me about student awards and recognition.", "Are there honors for academic achievements?", "How does the college recognize outstanding students?"],
 "responses": ["Explore student awards and recognition programs that celebrate academic achievements and outstanding contributions, highlighting the excellence of our students.", "Learn about honors and recognition bestowed upon outstanding students, acknowledging their academic accomplishments and positive impact on the college community."],
 "context_set": ""},

{"tag": "transportation_options",
 "patterns": ["What transportation options are available?", "Tell me about campus transportation services.", "Can students easily commute to and from the campus?"],
 "responses": ["Discover transportation options available to students, including campus services that facilitate easy commuting to and from the campus.", "Explore convenient transportation services that make commuting to and from the campus hassle-free for students."],
 "context_set": ""},

{"tag": "student_engagement_events",
 "patterns": ["Tell me about student engagement events.", "Are there campus-wide events for students?", "How can students get involved in college activities?"],
 "responses": ["Explore a vibrant calendar of student engagement events, including campus-wide activities that provide opportunities for students to get involved and connect with the college community.", "Get involved in exciting student engagement events, fostering a sense of community and creating memorable experiences during your college journey."],
 "context_set": ""},

{"tag": "personal_time_management",
 "patterns": ["How can students manage their time effectively?", "Tell me about time management resources.", "Are there tips for balancing academics and personal life?"],
 "responses": ["Discover resources and tips for effective time management, helping students balance academic responsibilities and personal life during their college journey.", "Learn effective time management strategies to optimize your academic experience while maintaining a healthy balance with personal life."],
 "context_set": ""}]}
                  